
## Plan Result




<pre><code>Plan: 15 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_api_management_subscription.case_creation_subscription
  * azurerm_api_management_subscription.document_subscription
  * azurerm_api_management_user.case_creation_user
  * azurerm_key_vault_secret.case_creation_subscription_key
  * azurerm_key_vault_secret.document_subscription_key
  * module.api-case-mgmt-product.azurerm_api_management_product.product
  * module.api-case-mgmt-product.azurerm_api_management_product_group.access_control_groups[&#34;developers&#34;]
  * module.case-mgmt-api.azurerm_api_management_api.api
  * module.case-mgmt-api.azurerm_api_management_product_api.link_to_product[0]
  * module.document-mgmt-api.azurerm_api_management_api.api
  * module.document-mgmt-api.azurerm_api_management_product_api.link_to_product[0]
  * module.document-mgmt-product.azurerm_api_management_product.product
  * module.document-mgmt-product.azurerm_api_management_product_group.access_control_groups[&#34;developers&#34;]
  * module.prl-case-creation-policy.azurerm_api_management_api_policy.api_policy
  * module.prl-document-policy.azurerm_api_management_api_policy.api_policy


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.case_creation_subscription will be created
  + resource "azurerm_api_management_subscription" "case_creation_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-stg"
      + display_name        = "Case Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = (known after apply)
      + resource_group_name = "cft-aat-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
      + user_id             = (known after apply)
    }

  # azurerm_api_management_subscription.document_subscription will be created
  + resource "azurerm_api_management_subscription" "document_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-stg"
      + display_name        = "Document subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = (known after apply)
      + resource_group_name = "cft-aat-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
      + user_id             = (known after apply)
    }

  # azurerm_api_management_user.case_creation_user will be created
  + resource "azurerm_api_management_user" "case_creation_user" {
      + api_management_name = "cft-api-mgmt-stg"
      + email               = "shashi.kariyappa@hmcts.net"
      + first_name          = "Shashi"
      + id                  = (known after apply)
      + last_name           = "Kariyappa"
      + resource_group_name = "cft-aat-network-rg"
      + state               = "active"
      + user_id             = "5931a75ae4bbd512288c690e"
    }

  # azurerm_key_vault_secret.case_creation_subscription_key will be created
  + resource "azurerm_key_vault_secret" "case_creation_subscription_key" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-aat"
      + name           = "courtnav-subscription-sub-key"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.document_subscription_key will be created
  + resource "azurerm_key_vault_secret" "document_subscription_key" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-aat"
      + name           = "document-subscription-sub-key"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # module.api-case-mgmt-product.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "cft-api-mgmt-stg"
      + approval_required     = false
      + display_name          = "case"
      + id                    = (known after apply)
      + product_id            = "case"
      + published             = true
      + resource_group_name   = "cft-aat-network-rg"
      + subscription_required = true
      + subscriptions_limit   = 20
    }

  # module.api-case-mgmt-product.azurerm_api_management_product_group.access_control_groups["developers"] will be created
  + resource "azurerm_api_management_product_group" "access_control_groups" {
      + api_management_name = "cft-api-mgmt-stg"
      + group_name          = "developers"
      + id                  = (known after apply)
      + product_id          = "case"
      + resource_group_name = "cft-aat-network-rg"
    }

  # module.case-mgmt-api.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "cft-api-mgmt-stg"
      + display_name          = "Case creation api"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "case-api"
      + path                  = "prl-cos-api"
      + protocols             = [
          + "http",
          + "https",
        ]
      + resource_group_name   = "cft-aat-network-rg"
      + revision              = "1"
      + service_url           = "http://prl-cos-aat.service.core-compute-aat.internal"
      + soap_pass_through     = false
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "swagger-link-json"
          + content_value  = "https://raw.githubusercontent.com/hmcts/reform-api-docs/master/docs/specs/case_creation.json"
        }

      + subscription_key_parameter_names {
          + header = (known after apply)
          + query  = (known after apply)
        }
    }

  # module.case-mgmt-api.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "cft-api-mgmt-stg"
      + api_name            = "case-api"
      + id                  = (known after apply)
      + product_id          = "case"
      + resource_group_name = "cft-aat-network-rg"
    }

  # module.document-mgmt-api.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "cft-api-mgmt-stg"
      + display_name          = "Case document api"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "document-api"
      + path                  = "prl-document-api"
      + protocols             = [
          + "http",
          + "https",
        ]
      + resource_group_name   = "cft-aat-network-rg"
      + revision              = "1"
      + service_url           = "http://prl-cos-aat.service.core-compute-aat.internal"
      + soap_pass_through     = false
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "swagger-link-json"
          + content_value  = "https://raw.githubusercontent.com/hmcts/reform-api-docs/master/docs/specs/prl_document_upload.json"
        }

      + subscription_key_parameter_names {
          + header = (known after apply)
          + query  = (known after apply)
        }
    }

  # module.document-mgmt-api.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "cft-api-mgmt-stg"
      + api_name            = "document-api"
      + id                  = (known after apply)
      + product_id          = "document"
      + resource_group_name = "cft-aat-network-rg"
    }

  # module.document-mgmt-product.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "cft-api-mgmt-stg"
      + approval_required     = false
      + display_name          = "document"
      + id                    = (known after apply)
      + product_id            = "document"
      + published             = true
      + resource_group_name   = "cft-aat-network-rg"
      + subscription_required = true
      + subscriptions_limit   = 20
    }

  # module.document-mgmt-product.azurerm_api_management_product_group.access_control_groups["developers"] will be created
  + resource "azurerm_api_management_product_group" "access_control_groups" {
      + api_management_name = "cft-api-mgmt-stg"
      + group_name          = "developers"
      + id                  = (known after apply)
      + product_id          = "document"
      + resource_group_name = "cft-aat-network-rg"
    }

  # module.prl-case-creation-policy.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "cft-api-mgmt-stg"
      + api_name            = "case-api"
      + id                  = (known after apply)
      + resource_group_name = "cft-aat-network-rg"
      + xml_content         = <<-EOT
            <policies>
                <backend>
                    <base/>
                </backend>
                <inbound>
                    <base/>
                    <!-- generate totp -->
                    <set-variable name="client_id" value="Test" />
                    <set-variable name="client_secret" value="TEST" />
                    <set-variable name="one_time_password" value="@{
                            const string Base32AllowedCharacters = "ABCDEFGHIJKLMNOPQRSTUVWXYZ234567";
                            var bits = "TEST".ToUpper().ToCharArray().Select(c => Convert.ToString(Base32AllowedCharacters.IndexOf(c), 2).PadLeft(5, '0')).Aggregate((a, b) => a + b);
                            var secretKeyBytes = Enumerable.Range(0, bits.Length / 8).Select(i => Convert.ToByte(bits.Substring(i * 8, 8), 2)).ToArray();
            
                            var unixTimestamp = (long) (DateTime.UtcNow.Subtract(new DateTime(1970, 1, 1))).TotalSeconds;
                            var timeIndex = unixTimestamp / 30;
                            byte[] challenge = BitConverter.GetBytes(timeIndex);
                            if (BitConverter.IsLittleEndian) {
                                Array.Reverse(challenge);
                            }
            
                            HMACSHA1 hmac = new HMACSHA1(secretKeyBytes);
                            byte[] hash = hmac.ComputeHash(challenge);
                            int offset = hash[19] & 0xf;
                            int truncatedHash = hash[offset] & 0x7f;
                            for (int i = 1; i < 4; i++)
                            {
                                truncatedHash <<= 8;
                                truncatedHash |= hash[offset + i] & 0xff;
                            }
                            truncatedHash %= 1000000;
                            return truncatedHash.ToString("D6");
                        }"/>
                    <send-request ignore-error="false" timeout="20" response-variable-name="s2sBearerToken" mode="new">
                        <set-url>http://rpe-service-auth-provider-aat.service.core-compute-aat.internal/lease</set-url>
                        <set-method>POST</set-method>
                        <set-header name="Content-Type" exists-action="override">
                            <value>application/json</value>
                        </set-header>
                        <set-body>@{
                            return new JObject(
                            new JProperty("microservice", (string)context.Variables["client_id"]),
                            new JProperty("oneTimePassword", (string)context.Variables["one_time_password"])
                            ).ToString();
                            }</set-body>
                    </send-request>
            
                    <set-header name="ServiceAuthorization" exists-action="override">
                        <value>@("Bearer " + ((IResponse)context.Variables["s2sBearerToken"]).Body.As<string>())</value>
                    </set-header>
                </inbound>
                <outbound>
                    <base/>
                </outbound>
                <on-error>
                    <base/>
                </on-error>
            </policies>
        EOT
    }

  # module.prl-document-policy.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "cft-api-mgmt-stg"
      + api_name            = "document-api"
      + id                  = (known after apply)
      + resource_group_name = "cft-aat-network-rg"
      + xml_content         = <<-EOT
            <policies>
                <backend>
                    <base/>
                </backend>
                <inbound>
                    <base/>
                    <!-- generate totp -->
                    <set-variable name="client_id" value="Test" />
                    <set-variable name="client_secret" value="TEST" />
                    <set-variable name="one_time_password" value="@{
                            const string Base32AllowedCharacters = "ABCDEFGHIJKLMNOPQRSTUVWXYZ234567";
                            var bits = "TEST".ToUpper().ToCharArray().Select(c => Convert.ToString(Base32AllowedCharacters.IndexOf(c), 2).PadLeft(5, '0')).Aggregate((a, b) => a + b);
                            var secretKeyBytes = Enumerable.Range(0, bits.Length / 8).Select(i => Convert.ToByte(bits.Substring(i * 8, 8), 2)).ToArray();
            
                            var unixTimestamp = (long) (DateTime.UtcNow.Subtract(new DateTime(1970, 1, 1))).TotalSeconds;
                            var timeIndex = unixTimestamp / 30;
                            byte[] challenge = BitConverter.GetBytes(timeIndex);
                            if (BitConverter.IsLittleEndian) {
                                Array.Reverse(challenge);
                            }
            
                            HMACSHA1 hmac = new HMACSHA1(secretKeyBytes);
                            byte[] hash = hmac.ComputeHash(challenge);
                            int offset = hash[19] & 0xf;
                            int truncatedHash = hash[offset] & 0x7f;
                            for (int i = 1; i < 4; i++)
                            {
                                truncatedHash <<= 8;
                                truncatedHash |= hash[offset + i] & 0xff;
                            }
                            truncatedHash %= 1000000;
                            return truncatedHash.ToString("D6");
                        }"/>
                    <send-request ignore-error="false" timeout="20" response-variable-name="s2sBearerToken" mode="new">
                        <set-url>http://rpe-service-auth-provider-aat.service.core-compute-aat.internal/lease</set-url>
                        <set-method>POST</set-method>
                        <set-header name="Content-Type" exists-action="override">
                            <value>application/json</value>
                        </set-header>
                        <set-body>@{
                            return new JObject(
                            new JProperty("microservice", (string)context.Variables["client_id"]),
                            new JProperty("oneTimePassword", (string)context.Variables["one_time_password"])
                            ).ToString();
                            }</set-body>
                    </send-request>
            
                    <set-header name="ServiceAuthorization" exists-action="override">
                        <value>@("Bearer " + ((IResponse)context.Variables["s2sBearerToken"]).Body.As<string>())</value>
                    </set-header>
                </inbound>
                <outbound>
                    <base/>
                </outbound>
                <on-error>
                    <base/>
                </on-error>
            </policies>
        EOT
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":5,"Program":"tfcmt","SHA1":"","Vars":{}} -->